; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-62)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l6)
    (at p3 l11)
    (at p4 l2)
    (at p5 l8)
    (at p6 l2)
    (at p7 l3)
    (at p8 l4)
    (at p9 l10)
    (at p10 l1)
    (at p11 l1)
    (at v1 l4)
    (at v2 l2)
    (at v3 l12)
    (at v4 l3)
    (at v5 l10)
    (road l12 l1)
    (road l3 l7)
    (road l1 l6)
    (road l11 l8)
    (road l1 l12)
    (road l6 l2)
    (road l9 l7)
    (road l5 l12)
    (road l8 l11)
    (road l6 l1)
    (road l1 l8)
    (road l7 l3)
    (road l7 l9)
    (road l12 l5)
    (road l4 l10)
    (road l8 l1)
    (road l8 l7)
    (road l10 l4)
    (road l10 l1)
    (road l2 l6)
    (road l1 l10)
    (road l7 l8)
    (road l1 l7)
    (road l7 l1)
    (road l4 l6)
    (road l6 l4)
    (road l2 l12)
    (road l12 l2)
    (road l11 l12)
    (road l12 l11)
    (road l10 l12)
    (road l12 l10)
    (road l4 l8)
    (road l8 l4)
    (road l3 l10)
    (road l10 l3)
    (road l4 l11)
    (road l11 l4)
    (road l6 l12)
    (road l12 l6)
    (road l5 l10)
    (road l10 l5)
    (road l2 l8)
    (road l8 l2)
    (road l2 l10)
    (road l10 l2)
    )
 (:goal (and 
(at p1 l6)
(at p2 l2)
(at p3 l9)
(at p4 l3)
(at p5 l11)
))
)

; plan
1. (drive v1 l4 l8)
   deleted: (at v1 l4)
   added: (at v1 l8)
   goals met: 0 of 5
2. (pick-up v1 l8 p1 c1 c2)
   deleted: (at p1 l8) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 5
3. (pick-up v1 l8 p5 c0 c1)
   deleted: (at p5 l8) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 0 of 5
4. (drive v1 l8 l11)
   deleted: (at v1 l8)
   added: (at v1 l11)
   goals met: 0 of 5
5. (drop v1 l11 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l11) (capacity v1 c1)
   goals met: 1 of 5
6. (pick-up v1 l11 p3 c0 c1)
   deleted: (at p3 l11) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 1 of 5
7. (drive v1 l11 l12)
   deleted: (at v1 l11)
   added: (at v1 l12)
   goals met: 1 of 5
8. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 1 of 5
9. (drop v1 l6 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l6) (capacity v1 c1)
   goals met: 2 of 5
10. (pick-up v1 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 2 of 5
11. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 2 of 5
12. (drop v1 l2 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l2) (capacity v1 c1)
   goals met: 3 of 5
13. (pick-up v1 l2 p4 c0 c1)
   deleted: (at p4 l2) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 5
14. (drive v1 l2 l10)
   deleted: (at v1 l2)
   added: (at v1 l10)
   goals met: 3 of 5
15. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 3 of 5
16. (drop v1 l3 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l3) (capacity v1 c1)
   goals met: 4 of 5
17. (drive v1 l3 l7)
   deleted: (at v1 l3)
   added: (at v1 l7)
   goals met: 4 of 5
18. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 4 of 5
19. (drop v1 l9 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l9) (capacity v1 c2)
   goals met: 5 of 5
